In [1]:
import pymysql

In [3]:
connection= pymysql.connect(host='LOCALHOST',user='root',password='your password')

In [4]:
cursor=connection.cursor()

In [5]:
### create database
query="Create database Inventory;"
cursor.execute(query)
connection.commit()

In [6]:
query1=""" SET FOREIGN_KEY_CHECKS = 0;
drop table if exists category;
          drop table if exists Inventory;
          drop table if exists Product;
          drop table if exists warehouse;
          drop table if exists customer;
          drop table if exists Order_details;"""

for statement in query1.split(";"):
    if statement.strip():
        cursor.execute(statement)
connection.commit()

OperationalError: (1046, 'No database selected')

In [7]:
## create data table 
query= """ use Inventory;

Drop table if exists Category;

Create table Category(
CategoryID varchar(50) Primary key,
CategoryName varchar (50));

Drop table if exists Product;

Create table Product(
ProductID varchar(50) Primary key,
ProductName varchar(50),
CategoryID varchar(50),
Price decimal(10,3),
reorderLEVEL int,
FOREIGN KEY (CategoryID) REFERENCES category(CategoryID));

Drop table if exists warehouse;

drop table if exists warehouse;
create table warehouse(
Warehouseid int Primary key,
WarehouseName varchar(50),
Location varchar(50));


drop table if exists Inventory;

Create table Inventory(
InventoryID int primary key,
ProductID varchar(50),
warehouseid int,
QuantityAvailable int,
FOREIGN KEY (ProductID) REFERENCES Product(ProductID),
FOREIGN KEY (warehouseid) REFERENCES warehouse(warehouseid)
);


drop table if exists customer;

create table customer(
CustomerID varchar(50) Primary key,
CustomerName varchar(50),
Phone varchar(50),
Email varchar(50),
Address varchar(50));

drop table if exists Order_details;

Create table Order_details(
OrderID varchar(50) Primary key,
CustomerID varchar(50),
ProductID varchar(50),
OrderDate date,
QuantityOrdered int,
Price decimal(10,2),
FOREIGN KEY (CustomerID) REFERENCES customer(CustomerID),
FOREIGN KEY (ProductID) REFERENCES Product(ProductID)
);

"""

In [8]:
for statement in query.split(';'):
    if statement.strip():
        cursor.execute(statement)
        
connection.commit

In [9]:
## insert the data into new created table

In [10]:
import pandas as pd 
from sqlalchemy import create_engine

In [37]:
engine=create_engine("mysql+pymysql://root:%40Jayjoshi555%40@localhost/Inventory")

In [38]:
category= pd.read_csv(r"D:\PROJECTS\StockFlow\categories.csv")
product=pd.read_csv(r"D:\PROJECTS\StockFlow\products.csv")
warehouse=pd.read_csv(r"D:\PROJECTS\StockFlow\warehouses.csv")
inventory=pd.read_csv(r"D:\PROJECTS\StockFlow\inventory.csv")
customer=pd.read_csv(r"D:\PROJECTS\StockFlow\customers.csv")
order=pd.read_csv(r"D:\PROJECTS\StockFlow\order_details.csv")

In [39]:
category.head()

  CategoryID CategoryName
0    1Moncid      Monitor
1    2Discid         Disk
2    3Keycid      Keybord
3    4Moucid        Mouse
4    5Pricid      Printer

In [40]:
product.head()

       ProductID          ProductName CategoryID   Price  ReorderLevel
0     IN33AlwWEB        Always Webcam   11webcid  673.50            35
1     IN34FulMtr         Full Monitor    1Moncid  298.52            48
2     IN34OthMtr       Others Monitor    1Moncid  371.04            13
3  IN452LeaGraph  Learn Graphics Card    7Gracid  488.19            20
4      IN10OnCPU               On CPU   12Cpucid  816.90            10

In [41]:
warehouse.head()

   WarehouseID               WarehouseName     Location
0            1         Davidport Warehouse    Bangalore
1            2         Port Paul Warehouse  switzerland
2            3           Maryton Warehouse       London
3            4         Port Erin Warehouse        Delhi
4            5  Lake Sherriville Warehouse     New York

In [42]:
inventory.head()

   InventoryID      ProductID  WarehouseID  QuantityAvailable
0            1     IN33AlwWEB            1                 25
1            2     IN34FulMtr            2                121
2            3     IN34OthMtr            3                252
3            4  IN452LeaGraph            4                454
4            5      IN10OnCPU            5                252

In [43]:
customer.head()

,CustomerID,CustomerName,Phone,Email,Address
0,91Aus,Austin Cantu,9791176864,thomasvalerie@collier.biz,Bangalore
1,77Tim,Timothy Palmer,9318892926,rmartinez@blackburn.com,switzerland
2,87Sco,Scott Griffin,8982749031,oferguson@gmail.com,switzerland
3,69And,Andrew Butler,9105747541,munozvalerie@vargas.com,Bangalore
4,35Jes,Jessica Stanley,9611905793,michellebailey@yahoo.com,switzerland

In [44]:
order.head() ## YYYY-MM-DD

  OrderID Customerid      ProductID  ORDERDATE  QuantityOrdered   Price
0     OD1      91Aus     IN33AlwWEB   1/4/2024              218  729.42
1     OD2      87Sco     IN34OthMtr  3/13/2024                3  823.03
2     OD3      66Mar  IN452KeeGraph   6/7/2024               34  908.00
3     OD4      54Sus    IN678UnRotr  7/12/2024              379  515.38
4     OD5      75Pam   IN453Meedriv   3/2/2024               39  257.60

In [45]:
order['ORDERDATE']=pd.to_datetime(order['ORDERDATE']).dt.strftime('%Y-%m-%d')

In [46]:
order.head()

  OrderID Customerid      ProductID   ORDERDATE  QuantityOrdered   Price
0     OD1      91Aus     IN33AlwWEB  2024-01-04              218  729.42
1     OD2      87Sco     IN34OthMtr  2024-03-13                3  823.03
2     OD3      66Mar  IN452KeeGraph  2024-06-07               34  908.00
3     OD4      54Sus    IN678UnRotr  2024-07-12              379  515.38
4     OD5      75Pam   IN453Meedriv  2024-03-02               39  257.60

In [47]:
### insert the data into new created table 

category.to_sql('category',con=engine,if_exists='append',index=False)

16

In [48]:
product.to_sql('product',con=engine,if_exists='append',index=False)

96

In [49]:
warehouse.to_sql('warehouse',con=engine,if_exists='append',index=False)

100

In [50]:
inventory.to_sql('Inventory',con=engine,if_exists='append',index=False)

C:\Users\jay\AppData\Local\Temp\ipykernel_11352\1543761948.py:1: UserWarning: The provided table name 'Inventory' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  inventory.to_sql('Inventory',con=engine,if_exists='append',index=False)

1000

In [51]:
customer.to_sql('customer',con=engine,if_exists='append',index=False)

49

In [52]:
order.to_sql('order_details',con=engine,if_exists='append',index=False)

999